
#코드는 가끔은 사람이 이해할수 있는 말이지만, 컴퓨터를 위한 말이다
#잘 모르는 코드 옆에는 메모를 남겨두면 공부하는데 도움이 되고,
#어려운 코드 옆에는 설명을 적어두면 나중에 그 코드를 다시 보는데 도움이 된다.


print('안녕! 나는', '지구인' , '이야. 나는 다리가' ,4,'개있어.')
identity = '지구인'
number_of_legs = 4
print('안녕! 나는', identity, '이야. 나는 다리가' ,number_of_legs , '개있어.')
identity = '한국인'
number_of_legs = 2
#print('안녕! 나는', identity, '이야. 나는 다리가' ,number_of_legs , '개있어.')

#범위 주석 = """ 로 둘러쌓기
'''
print('안녕! 나는', '지구인' , '이야. 나는 다리가' ,4,'개있어.')
identity = '지구인'
number_of_legs = 4

'''

# ''' ~ ''' // """ ~ """ 는 문장의 string을 표현할때, 영역 주석을 표현할때